["```py\nWrite a poem about nature.\n```", "```py\nWrite a poem about nature with the following properties:\nFormat: sonnet\nTheme: how the changing seasons affect human emotions\nPrimary emotion: the poem should focus particularly on the transition from summer to autumn and the sense of longing that some humans feel when summer is coming to an end.\n```", "```py\nSuggest ideas for a new business that will help me make money.\n```", "```py\nI want to develop a video game that helps kids to learn mathematics. The target audience will be kids between ten and fifteen years old, and the game will focus on algebra and precalculus. List and explain the steps I need to take to start this business.\n```", "```py\nIf an investor places $10,000 in a savings account with an annual interest rate of 5% and the interest is compounded annually, how much money will be in the account after 3 years?\n```", "```py\nAnnually compounded interest means the interest is added to the principal amount at the end of each year, and in the next year, interest is earned on the new principal. Based on that information, work through the following process step by step: If an investor places $10,000 in a savings account with an annual interest rate of 5% and the interest is compounded annually, how much money will be in the account after 3 years?\n```", "```py\nThe following are some examples of product reviews, as well as the categorized customer sentiment associated with those reviews:\nReview: \"Sending this back because the strap broke the first time I used it.\" Sentiment: Negative. Properties: construction.\nReview: \"Love the color! It's the perfect size and seems well-made.\" Sentiment: Positive. Properties: appearance, construction.\nReview: \"Disappointed. The zipper gets stuck constantly.\" Sentiment: Negative. Properties: construction.\nBased on those reviews and their associated sentiment categorizations, categorize the sentiment of the following review:\n\"The fabric feels flimsy, and I'm worried it might tear easily.\"\n```", "```py\nSummarize the [Report Name] report for [Target Audience], considering that [Target Audience] is particularly interested in reviewing increases or decreases in [Metric 1] and [Metric 2].\n```"]