["```py\nSELECT data FROM BPAWorkQueueItem wqi, BPAWorkQueue wq\nWHERE wq.name = 'ML Queue Name (To Change)'\nAND wqi.queueid = wq.id;\n```", "```py\nSELECT * FROM\n(SELECT logid, stagename, LAG(result, 1, 0) OVER(ORDER BY logid) as modelversion, attributexml, startdatetime from BPASessionLog_NonUnicode WHERE stagename in ('Log [Model Version]', 'Set [Prediction] and [Confidence Score]') AND processname = 'To Change') as tbl\nWHERE stagename = 'Set [Prediction] and [Confidence Score]';\n```", "```py\nSELECT logid, stagename, result, attributexml, startdatetime from BPASessionLog_NonUnicode\nWHERE stagename = 'Log New Model Evaluation Results'\nAND processname = 'To Change';\n```", "```py\nSELECT data FROM BPAWorkQueueItem wqi, BPAWorkQueue wq\nWHERE wq.name = 'ML Queue Name (To Change)'\nAND data like '%\"Confidence\"%'\nAND wqi.queueid = wq.id;\n```", "```py\nSELECT logid, attributexml, startdatetime from BPASessionLog_NonUnicode\nWHERE stagename = 'Set [Reviewed Prediction] and [Review Justification]'\nAND processname = 'attributexml column will need to be parsed by the data scientists manually or opened in Excel.\n\t\t\tSummary\n\t\t\tIn this chapter, we discussed two topics which are new, ongoing activities that are required by IA: ML deployments and database operations.\n\t\t\tFor deployments of model updates, we discussed the different strategies that are available for Web API, CLI script, and Code Stage-based ML models. Regardless of how the ML model is deployed, we need to think clearly about which steps are needed to update the IA solution, and how to roll it back. This includes whether downtime is needed, what needs to be changed (Objects, Processes, Web API Service Configurations, Environment Variables, copying files, etc.), who performs these changes, and in what order they should be performed in.\n\t\t\tIA affects BP database operations in two main ways. IA leads to faster database table growth, especially for the Work Queue and Session Log tables. The database team that supports IA must really perfect their database maintenance as database growth can negatively affect the performance of BP. Next, IA requires more reports and audits to be generated. It may be desirable to do this from the database. Some sample SQL queries have been provided to extract ML-related logs that work with the Process templates of [*Chapter 6*](B18416_06.xhtml#_idTextAnchor093) and [*Chapter 7*](B18416_07.xhtml#_idTextAnchor114).\n\t\t\tThe ongoing IA operations discussed in this chapter, together with the LAM, User Roles and MTE of [*Chapter 8*](B18416_08.xhtml#_idTextAnchor133) are part of a larger topic, called the BP **Robotic Operating Model** (**ROM**). The ROM is a methodology designed to help firms achieve their automation outcomes. In the next chapter, we’ll be discussing what potential changes IA will have on the ROM.\n\n```"]