["```py\nfrom langchain import LLMChain, PromptTemplate\nfrom langchain_community.embeddings import BedrockEmbeddings\nfrom langchain_community.vectorstore import OpenSearchVectorSearch\nfrom langchain_community.llms.bedrock import Bedrock\nfrom langchain.chains import RetrievalQA\nimport opensearch \nbedrock_client = get_bedrock_client(region, …)\nbedrock_llm = create_bedrock_llm(bedrock_client)\nopensearch_endpoint = opensearch.get_opensearch_endpoint(index_name, …)\nopensearch_vector_search_client = create_opensearch_vector_search_client(index_name, bedrock_embeddings_client, …)\n# Define a prompt template \nprompt = PromptTemplate(\n  input_variables=[\"context\", \"question\"],\n  template=\"Answer the question based on the retrieved\n  context: {context}\n  Question: {question}\n  Answer:\")\n# Create a chain with Bedrock model and prompt \nqa_chain = RetrievalQA.from_chain_type(llm=bedrock_llm, retriever=opensearch_vector_client.as_retriever(), chain_type_kwarges={\"prompt\": prompt}\n)\nquestion = \"What is the capital of France?\"\nresult = qa_chain(question=question) \n```", "```py\n`Action`: Analyze financial reports [from companies X, Y, Z] between 2020-2022 to identify key trends, growth and risk areas.\n`Context`: These companies operate in [industry]. Focus on major changes in financial KPIs like revenue, costs, profits, debt. Call out important shifts across business segments, geographies, products. Highlight growth opportunities but also flag potential risks.\n`Input Data`: [text from actual company financial filings]\n`Output`:\n`Revenue trend`:\n`Cost trend`:\n`Profitability trend`:\n`Growth areas`:\n`Decline areas`:\n`Major risks`: \n```", "```py\n`Action`: Search de-identified electronic health records to identify patients meeting the following criteria:\n`Inclusion Criteria`:\n`Age between 40-60`\n`Diagnosis of hypertension (ICD-10 code I10)`\n`Prescribed beta blockers in 2022`\n`Exclusion Criteria`:\n`History of heart failure`\n`Currently hospitalized` \n```", "```py\n`Action`: Write a script for a compelling Law & Order episode in a classic procedural drama style.\n`Context`: This is for Law & Order's flagship show set in New York City following NYPD detectives investigating crimes and the prosecutors who ultimately try the cases. Base the script on fictional characters and events. Focus the plot on an intriguing murder mystery that explores moral dilemmas around crime and justice. Align the tone and dialogue with the show's dramatic yet grounded writing style. Structure the script in a three-act format with an exciting opening scene, plot twists, and a suspenseful climax leading to a just resolution. Describe the settings and character actions vividly. Follow standard screenwriting conventions and formatting.\n`Script Details`:\nApproximately 50 scenes\nOpening scene introduces the victim and mystery\nDetectives pursue leads through witty interrogations\nProsecutors debate legal strategy and ethics\nRed herrings before revealing the true perpetrator\nThoughtful closing arguments and courtroom drama \n```", "```py\n`Title`: Law & Order Episode: \"Shadows of Deceit\"\nINT. DARK ALLEY - NIGHT\nRain pours down on a desolate New York City alley. A shadowy figure lurks in the darkness, holding a gleaming knife. JASON HARPER (late 30s, rugged detective) and LUCY MARTIN (early 30s, sharp-witted detective) arrive at the crime scene. Flashing lights and uniformed officers create an eerie atmosphere.\nEXT. DARK ALLEY - CONTINUOUS\nThey discover the lifeless body of SARAH WESTON (early 40s, elegant, with a secret), dressed in a pristine white gown, her face frozen in fear.\nJASON\n (whispering) What kind of monster does this?\nINT. POLICE STATION - INTERROGATION ROOM - MORNING\nJason and Lucy interrogate EDWARD KINGSLEY (50s, wealthy businessman), the victim's secret lover.\nEDWARD\n (sweating) I didn't kill her! I loved her!\n…. \n```", "```py\nRain pours down on a desolate New York City alley. A shadowy figure lurks in the darkness, holding a gleaming knife. \n```", "```py\n`Action`: Generate a 3D rendering of a futuristic electric sports car exterior concept emphasizing aerodynamics and aggressive styling.\n`Context`: This is an electric sports car aimed at the premium market. Focus on creating an extremely aerodynamic shape with sweeping curves and sharp angles. Make it appear powerful, nimble, and high-tech. Incorporate design elements that maximize battery range by reducing drag and turbulence. The styling should feel bold, exotic, and heavily influenced by fighter jets. Render the concept in a three-quarters front perspective in vibrant red. Add dramatic studio lighting to accentuate the design.\n`Additional Details`:\n2-door coupe body style\nEmphasize the wide and low visual stance\nLarge air intakes for brake cooling\nFuturistic looking wheels\nLED accent lighting\nClosed grille since it's an EV \n```"]